Repository: itsbilolbek/uzbek-net-dictionary
Catalog: gnome/circle/amberol.main.*.po
Languages: uz

source: Music Player
uz: Musiqiy pleyer

source: music;player;media;audio;playlist;
uz: musiqa;pleyer;media;audio;pleylist;

source: Plays music, and nothing else
uz: Musiqa yangraydi, boshqa hech narsa yoʻq

source: Amberol is a music player with no delusions of grandeur. If you just want to play music available on your local system then Amberol is the music player you are looking for.
uz: Amberol - buyuklik vasvasalariga ega boʻlmagan musiqa ijrochisi. Agar faqat mahalliy tizimingizda mavjud musiqani tinglamoqchi boʻlsangiz, Amberol aynan siz qidirayotgan musiqa pleyeridir.

source: Current features:
uz: Joriy funksiyalar:

source: adaptive UI
uz: moslashuvchan UI

source: UI recoloring using the album art
uz: Albom rasmidan foydalangan holda UI rangini oʻzgartirish

source: drag and drop support to queue songs
uz: qoʻshiqlarni navbatga qoʻshish uchun sichqoncha bilan sudrab tashlash imkoniyati

source: shuffle and repeat
uz: aralashtirish va takrorlash

source: MPRIS integration
uz: MPRIS integratsiyasi

source: Emmanuele Bassi
uz: Emmanuel Bassi

source: Play the Previous Song
uz: Avvalgi musiqani ijro etish

# a11y
source: Skip backwards
uz: Orqaga oʻtkazish

source: Toggle Play
uz: Ijroni boshla/toʻxtat

# a11y
source: Toggle play
uz: Ijroni boshla/toʻxtat

source: Play the Next Song
uz: Keyingi musiqani ijro etish

# a11y
source: Skip forward
uz: Oldinga oʻtkazish

source: Toggle Playlist
uz: Pleylistni yoqish/oʻchirish

# a11y
source: Toggle playlist
uz: Pleylistni yoqish/oʻchirish

source: Shuffle the Playlist
uz: Pleylistni tasodifiy tartibda ijro etish

# a11y
source: Shuffle
uz: Aralashtirish

source: Enable Repeat
uz: Qayta takrorlashni yoqish

# a11y
source: Repeat
uz: Takrorlash

source: Main Menu
uz: Asosiy menyu

# a11y
source: Primary menu
uz: Asosiy menyu

source: Copy
uz: Nusxa

source: Open Directory
uz: Direktoriyani ochish

source: Add _Song
uz: Musiqa qoʻshish

source: Add _Folder
uz: Jild qoʻshish

source: Clear
uz: Tozalash

source: _Match Cover Art
uz: Muqova rasmini moslashtirish

source: _Background Playback
uz: Orqa fonda ijro etish

# replaygain-menu
source: _Album
uz: Albom

# replaygain-menu
source: _Song
uz: Musiqa

# replaygain-menu
source: _Disabled
uz: Faolsizlantirilgan

source: _Keyboard Shortcuts
uz: Klaviatura tezkor tugmalari

source: _About Amberol
uz: Amberol haqida

source: _Quit
uz: Chiqish

source: Search Songs in the Playlist
uz: Pleylistdagi qoʻshiqlarni qidirish

source: Playlist
uz: Pleylist

source: Close the Playlist
uz: Pleylistni yopish

source: Select Songs in the Playlist
uz: Pleylistdan musiqalarni tanlang

source: Search songs
uz: Musiqalarni qidirish

# a11y
source: Search
uz: Qidirish

# a11y
source: Type to search songs
uz: Qoʻshiqlarni qidirish uchun yozing

source: Select All Songs
uz: Barcha musiqalarni tanlash

source: Remove Selected Songs
uz: Tanlangan musiqalarni oʻchirish

# a11y
source: No cover available
uz: Muqova mavjud emas

# a11y
source: Currently playing
uz: Hozir ijro etilmoqda

# shortcut window
source: General
uz: Umumiy

# shortcut window
source: Toggle primary menu
uz: Birlamchi menyuni yoqish/oʻchirish

# shortcut window
source: Copy song details to the clipboard
uz: Musiqa tafsilotlarini buferga nusxalash

# shortcut window
source: Show shortcuts
uz: Tezkor tugmalarni koʻrsatish

# shortcut window
source: Quit
uz: Chiqish

# shortcut window
source: Playlist
uz: Pleylist

# shortcut window
source: Add a song to the playlist
uz: Pleylistga qoʻshiq qoʻshish

# shortcut window
source: Add a folder to the playlist
uz: Pleylistga jild qoʻshish

# shortcut window
source: Clear the playlist
uz: Pleylistni tozalash

# shortcut window
source: Toggle the playlist pane
uz: Pleylist oynasini yoqish/oʻchirish

# shortcut window
source: Toggle shuffling songs
uz: Qoʻshiqlarni tasodifiy tartibda ijro etishni yoqish/oʻchirish

# shortcut window
source: Playback
uz: Qayta ijro

# shortcut window
source: Toggle play/pause
uz: Ijro/toʻxtatish tugmasi

# shortcut window
source: Previous song
uz: Avvalgi musiqa

# shortcut window
source: Next song
uz: Keyingi musiqa

# shortcut window
source: Seek backwards in the current song
uz: Joriy qoʻshiqni orqaga qaytarish

# shortcut window
source: Seek forward in the current song
uz: Joriy qoʻshiqni oldinga oʻtkazish

source: Drop a song to add it to the playlist
uz: Pleylistga kiritish uchun musiqani tashlang

source: Select a file or a folder, or drag files from your file manager to the application window to add songs to the playlist
uz: Pleylistga qoʻshiqlar qoʻshish uchun fayl yoki jildni tanlang yoki fayl boshqaruvidagi fayllarni ilova oynasiga tortib tashlang

source: Restore Playlist
uz: Pleylistni tiklash

source: Add Folder
uz: Jild qoʻshish

source: Add Song
uz: Qoʻshiq qoʻshish

# a11y
source: Elapsed time
uz: Oʻtib ketgan vaqt

# a11y
source: Remaining time
uz: Qolgan vaqt

source: translator-credits
uz: tarjimon-kreditlar

source: Amberol needs to run in the background to play music
uz: Musiqa ijro etish uchun Amberol dasturi orqa fonda ishlab turishi kerak

source: Playback in progress
uz: Ijro jarayonida

source: Unknown artist
uz: Noma’lum ijrochi

source: Unknown title
uz: Noma’lum nom

source: Unknown album
uz: Notanish albom

source: Cover image
uz: Muqova rasmi

source: Repeat All Songs
uz: Barcha musiqalarni takrorlash

source: Repeat the Current Song
uz: Joriy musiqani takrorlash

source: Audio files
uz: Audio fayllar

source: _Add Song
uz: Musiqa qoʻshish

source: Open File
uz: Faylni ochish

source: Unable to access files
uz: Fayllardan foydalanish imkoni yoʻq

source: _Add Folder
uz: Jild qoʻshish

source: Open Folder
uz: Jildni ochish

source: No available song found
uz: Mavjud qoʻshiq topilmadi

source: No songs found
uz: Hech qanday musiqa topilmadi

source: Added a new song
uz: Yangi musiqa kiritildi

source: Play
uz: Ijro

source: Added one song
uz: {} ta musiqa kiritildi

source: Unable to access dropped files
uz: Tashlab yuborilgan fayllarga kirish imkonsiz

source: {} minute
uz: {} daqiqa

source: {hours} hour {minutes} remaining
uz: {hours} soat {minutes} daqiqa qoldi

source: {} minute remaining
uz: {} daqiqa qoldi

source: No song selected
uz: Qoʻshiq tanlanmagan

source: {} song selected
uz: {} ta musiqa tanlandi

source: Currently playing “{title}” by “{artist}”
uz: Hozirgi "{title}" musiqa "{artist}" tomonidan ijro etilmoqda

source: Unable to open folder
uz: Jildni ochish imkonsiz
