Repository: itsbilolbek/uzbek-net-dictionary
Catalog: gnome/circle/AudioSharing.main.*.po
Languages: uz

source: @NAME@
uz: @NOMI@

source: Gnome;GTK;audio;sharing;sound;
uz: Gnome;GTK;audio;almashish;tovush;

source: Share your computer audio
uz: Kompyuteringiz ovozini ulashing

source: With Audio Sharing you can share your current computer audio playback in the form of an RTSP stream. This stream can then be played back by other devices, for example using VLC.
uz: Audio almashish bilan siz RTSP oqimi koʻrinishida kompyuteringizdagi joriy audio ijrosini baham koʻrishingiz mumkin. Keyinchalik bu oqim boshqa qurilmalar tomonidan, masalan, VLC yordamida oʻynalishi mumkin.

source: By sharing the audio as a network stream, you can also use common devices that are not intended to be used as audio sinks (eg. smartphones) to receive it. For example, there are audio accessories that are not compatible with desktop computers (e.g. because the computer does not have a Bluetooth module installed). With the help of this app, the computer audio can be played back on a smartphone, which is then connected to the Bluetooth accessory.
uz: Ovozni tarmoq oqimi sifatida baham koʻrish orqali siz uni qabul qilish uchun audio qabul qiluvchi sifatida foydalanish uchun moʻljallanmagan umumiy qurilmalardan (masalan, smartfonlar) ham foydalanishingiz mumkin. Misol uchun, ish stoli kompyuterlari bilan mos kelmaydigan audio aksessuarlar mavjud (masalan, kompyuterda Bluetooth moduli oʻrnatilmaganligi sababli). Ushbu ilova yordamida kompyuter ovozini smartfonda oʻynatish mumkin, keyinchalik u Bluetooth aksessuariga ulanadi.

source: Felix Häcker
uz: Feliks Xaker

source: Connect to the audio stream by scanning the QR code or copying the address
uz: QR kodini skanerlash yoki manzilni nusxalash orqali audio oqimga ulaning

source: Menu
uz: Menyu

source: _Copy to Clipboard
uz: Buferga nusxalash

source: You are currently sharing your audio. You can access it from other devices in the same network by scanning the QR code or entering the displayed address in a playback app that supports RTSP streams. This device can be muted, the audio will still be shared. To stop sharing, simply close this window.
uz: Siz hozir audioni baham koʻryapsiz. QR kodini skanerlash yoki RTSP oqimlarini qoʻllab-quvvatlaydigan ijro ilovasida koʻrsatilgan manzilni kiritish orqali unga bir tarmoqdagi boshqa qurilmalardan kirishingiz mumkin. Bu qurilma ovozini oʻchirib qoʻyish mumkin, audio hamon baham koʻriladi. Ulashishni toʻxtatish uchun ushbu oynani yoping.

source: Unable to Share Audio
uz: Audioni ulashish imkonsiz

source: Open _Help <sup>↗</sup>
uz: Yordamni oching <sup>↗</sup>

source: _About Audio Sharing
uz: _Ovoz almashish haqida

source: A client has established a connection
uz: Mijoz aloqa oʻrnatdi

source: Audio playback from this device gets shared.
uz: Bu qurilmadan audio ijro ulashiladi.

source: translator-credits
uz: Nodirbek Nuraliyev Baxrom Raxmatov

source: Donate
uz: Xayriya qiling

source: Copied address to clipboard
uz: Manzil vaqtinchalik xotiraga nusxalandi
