Repository: itsbilolbek/uzbek-net-dictionary
Catalog: gnome/circle/authenticator.master.*.po
Languages: uz

source: Authenticator
uz: Tasdiqlovchi

source: Two-Factor Authentication
uz: Ikki bosqichli autentifikatsiya

source: Generate two-factor codes
uz: Ikki bosqichli kodlar yaratish

source: Gnome;GTK;Verification;2FA;Authentication;OTP;TOTP;
uz: Gnome;GTK;Verifikatsiya;2FA;Autentifikatsiya;OTP;TOTP;

source: Default window width
uz: Odatiy oyna kengligi

source: Default window height
uz: Odatiy oyna balandligi

source: Default window maximized behaviour
uz: Odatiy oyna maksimallashtirilgan xatti-harakati

source: Auto lock
uz: Avtomatik qulflash

source: Whether to auto lock the application or not
uz: Ilovani avtomatik qulflash yoki qulflamaslik

source: Auto lock timeout
uz: Avtomatik qulflash vaqti tugadi

source: Lock the application on idle after X minutes
uz: Ilovani X daqiqadan keyin qulflash

source: Download Favicons
uz: Favikonlarni yuklab olish

source: Download Favicons over metered connections
uz: Hisoblangan ulanishlar orqali Favicon ilovasini yuklab olish

source: Whether the application should download favicons over a metered connection.
uz: Ilova favikonlarni hisoblangan ulanish orqali yuklab olishi kerakmi?

source: Simple application for generating Two-Factor Authentication Codes.
uz: Ikki bosqichli autentifikatsiya kodlarini generatsiyalash uchun oddiy ilova.

source: Features:
uz: Xususiyatlar:

source: Time-based/Counter-based/Steam methods support
uz: Vaqtga asoslangan/Qarama-qarshi/Steam usullarini qoʻllab-quvvatlash

source: SHA-1/SHA-256/SHA-512 algorithms support
uz: SHA-1/SHA-256/SHA-512 algoritmlarini qoʻllab-quvvatlash

source: QR code scanner using a camera or from a screenshot
uz: Kamera yoki skrinshot yordamida QR kod skaneri

source: Lock the application with a password
uz: Ilovani parol bilan qulflash

source: Beautiful UI
uz: Chiroyli interfeys

source: GNOME Shell search provider
uz: GNOME Shell qidiruv ta’minotchisi

source: Backup/Restore from/into known applications like FreeOTP+, Aegis (encrypted / plain-text), andOTP, Google Authenticator
uz: FreeOTP+, Aegis (shifrlangan / oddiy matn) va OTP, Google Authenticator kabi ma’lum ilovalardan/ilovalarga zaxiralash/tiklash

source: Main Window
uz: Asosiy oyna

source: Add a New Account
uz: Yangi hisob qoʻshish

source: Add a New Provider
uz: Yangi ta’minotchi qoʻshish

source: Account Details
uz: Hisob maʼlumotlari

source: Backup/Restore formats support
uz: Zaxiralash/Tiklash formatlarini qoʻllab-quvvatlash

source: _Camera
uz: Kamera

source: _Screenshot
uz: Skrinshot

source: _QR Code Image
uz: QR kod rasmi

source: _Cancel
uz: Bekor qilish

source: _Add
uz: Qoʻshish

source: Scan QR Code
uz: QR kodni skanerlash

source: Provider
uz: Ta’minotchi

source: Token issuer
uz: Token chiqaruvchi

source: Account
uz: Hisob

source: Counter
uz: Hisoblagich

source: Algorithm
uz: Algoritm

source: Computing Method
uz: Hisoblash usuli

source: Period
uz: Davr

source: Duration in seconds until the next password update
uz: Keyingi parol yangilanishiga bir necha soniya qoldi

source: Digits
uz: Raqamlar

source: Length of the generated code
uz: Yaratilgan kodning uzunligi

source: Website
uz: Vebsayt

source: How to Set Up
uz: Qanday sozlanadi

source: Camera
uz: Kamera

source: Create Provider
uz: Ta’minotchi yaratish

source: _Save
uz: Saqlash

source: _Delete
uz: Oʻchirish

source: Help
uz: Yordam

source: Increment the counter
uz: Hisoblagichni orttirish

source: Copy PIN to clipboard
uz: PIN kodni vaqtinchalik xotiraga nusxalash

source: Account details
uz: Hisob maʼlumotlari

source: Backup & Restore
uz: Zaxiralash va tiklash

source: Backup
uz: Zaxiralash

source: Restore
uz: Qayta tiklash

source: No Camera Found
uz: Hech qanday kamera topilmadi

source: _From a Screenshot
uz: Skrinshotdan

source: Secret Service Error
uz: Maxfiy xizmat xatosi

source: Authenticator relies on a Secret Service Provider to manage your sensitive session information and an error occurred while we were trying to store or get your session.
uz: Autentifikator maxfiy seans axborotingizni boshqarish uchun maxfiy xizmat ta’minotchisiga tayanadi va seansingizni saqlash yoki olishga urinish paytida xatolik yuz berdi.

source: Here are a few things that might help you fix issues with the Secret Service:
uz: Maxfiy xizmat bilan bogʻliq muammolarni hal qilishda yordam berishi mumkin boʻlgan ba’zi narsalar:

source: Make sure you have a Secret Service Provider installed, like gnome-keyring.
uz: Gnom-keyring kabi maxfiy xizmat ta’minotchisi oʻrnatilganini tekshiring.

source: Check that you have a default keyring and that it is unlocked.
uz: Sizda birlamchi keyring borligini va u qulfdan chiqarilganini tekshiring.

source: Check the application logs and your distribution’s documentation for more details.
uz: Tafsilotlar uchun ariza jurnallari va distributsiyangiz hujjatlarini tekshiring.

source: General
uz: Umumiy

source: Privacy
uz: Maxfiylik

source: _Passphrase
uz: Parol iborasi

source: Set up a passphrase to lock the application with
uz: Ilovani qulflash uchun kodli iborani sozlang

source: _Auto Lock the Application
uz: Ilovani avtomatik qulflash

source: Whether to automatically lock the application
uz: Ilova avtomatik qulflansinmi

source: Auto Lock _Timeout
uz: Avtomatik qulflash vaqti tugadi

source: The time in minutes
uz: Vaqt daqiqalarda

source: Network
uz: Tarmoq

source: _Download Favicons
uz: Faviconlarni yuklab olish

source: Automatically attempt fetching a website icon
uz: Vebsayt belgisini avtomatik olishga urinish

source: _Metered Connection
uz: Oʻlchangan ulanish

source: Fetch a website icon on a metered connection
uz: Hisoblangan aloqada vabsayt belgisini olish

source: Create Password
uz: Parol yaratish

source: Set up a Passphrase
uz: Parol iborasini sozlash

source: Authenticator will start locked after a passphrase is set.
uz: Parol iborasi sozlanganidan keyin tasdiqlovchi qulflana boshlaydi.

source: Current Passphrase
uz: Joriy kodli ibora

source: New Passphrase
uz: Yangi kodli ibora

source: Repeat Passphrase
uz: Parol iborasini takrorlash

source: _Reset
uz: Asliga qaytarish

source: Select a _File
uz: Fayl tanlan

source: Name
uz: Ism

source: The by default value for counter-based computing method
uz: Qarama-qarshi hisoblash usuli uchun standart qiymat

source: Help URL
uz: Yordam URL manzili

source: Providers
uz: Ta’minotchilar

source: New Provider
uz: Yangi ta’minotchi

source: Search
uz: Qidirish

source: Search…
uz: Qidirish…

source: No Results
uz: Natijalar yoʻq

source: No providers matching the query were found.
uz: Soʻrovga mos keladigan ta’minotchilar topilmadi.

source: No Provider Selected
uz: Hech qanday ta’minotchi tanlanmagan

source: Select a provider or create a new one
uz: Ta’minotchini tanlang yoki yangisini yarating

source: No accounts or providers matching the query were found.
uz: Soʻrovga mos hech qanday hisob yoki ta’minotchi topilmadi.

# shortcut window
source: General
uz: Umumiy

# shortcut window
source: Keyboard Shortcuts
uz: Tezkor tugmalar

# shortcut window
source: Lock
uz: Qulf

# shortcut window
source: Preferences
uz: Afzalliklar

# shortcut window
source: Quit
uz: Chiqish

# shortcut window
source: Accounts
uz: Hisoblar

# shortcut window
source: New Account
uz: Yangi hisob qoʻshish

# shortcut window
source: Search
uz: Qidirish

# shortcut window
source: Show Providers List
uz: Ta’minotchilar roʻyxatini chiqarish

source: _Lock the Application
uz: Ilovani qulflash

source: P_roviders
uz: Ta’minotchilar

source: _Preferences
uz: Afzalliklar

source: _Backup & Restore
uz: Zaxiralash va tiklash

source: _Keyboard Shortcuts
uz: Klaviatura yorliqlari

source: _About Authenticator
uz: Tasdiqlagich haqida

source: Authenticator is Locked
uz: Tasdiqlagich qulflangan

source: _Unlock
uz: Qulfni ochish

source: Accounts
uz: Hisoblar

source: New Account
uz: Yangi hisob qoʻshish

source: Main Menu
uz: Asosiy Menyu

source: No Accounts
uz: Hisoblar yoʻq

source: Add an account or scan a QR code first.
uz: Avval hisob kiriting yoki QR kodni skanerlang.

source: Accounts restored successfully
uz: Hisoblar muvaffaqiyatli tiklandi

source: translator-credits
uz: Hamidulloh Toʻxtayev <toxtayevhamidulloh6997@gmail.com>

source: One-Time password copied
uz: Bir martalik parol nusxalandi

source: Password was copied successfully
uz: Parol muvaffaqiyatli nusxalandi

source: Into a JSON file containing plain-text or encrypted fields
uz: Oddiy matn yoki shifrlangan maydonlarni oʻz ichiga olgan JSON formatidagi faylga

source: From a JSON file containing plain-text or encrypted fields
uz: Oddiy matn yoki shifrlangan maydonlarni oʻz ichiga olgan JSON formatidagi fayldan

source: a_ndOTP
uz: va OTP

source: Into a plain-text JSON file
uz: Oddiy matnli JSON faylga

source: an_dOTP
uz: va OTP

source: From a plain-text JSON file
uz: Oddiy matnli JSON faylidan

source: Unknown account
uz: Notanish hisob

source: Unknown issuer
uz: Noma’lum chiqaruvchi

source: _Authenticator
uz: Tasdiqlovchi

source: Into a plain-text file, compatible with FreeOTP+
uz: FreeOTP+ bilan ishlaydigan oddiy matnli faylga

source: A_uthenticator
uz: Tasdiqlovchi

source: From a plain-text file, compatible with FreeOTP+
uz: FreeOTP+ bilan ishlaydigan oddiy matnli fayldan

source: From a plain-text JSON file, compatible with FreeOTP+
uz: FreeOTP+ bilan ishlaydigan oddiy matnli JSON fayldan

source: Google Authenticator
uz: Google Tasdiqlovchi

source: From a QR code generated by Google Authenticator
uz: Google Tasdiqlovchi tomonidan yaratilgan QR koddan

source: Au_thenticator (Legacy)
uz: Tasdiqlovchi (Eskirgan)

source: From a ZIP export generated by Raivo OTP
uz: Raivo OTP tomonidan yaratilgan ZIP eksportidan

source: Yandex Key
uz: Yandex kaliti

source: From a plain-text file generated by Yandex Key
uz: Yandex Kalit tomonidan yaratilgan oddiy matn faylidan

source: Counter-based
uz: Qarshi-asoslangan

source: Time-based
uz: Vaqtga-asoslangan

source: Image
uz: Rasm

source: Select QR Code
uz: QR kodni tanlang

source: Invalid Token
uz: Yaroqsiz token

source: Are you sure you want to delete the account?
uz: Haqiqatan ham hisobni oʻchirmoqchimisiz?

source: This action is irreversible
uz: Bu amal orqaga qaytmaydi

source: No
uz: Yoʻq

source: Yes
uz: Ha

source: Key / Passphrase
uz: Kalit / Parol iborasi

source: Select File
uz: Faylni belgilash

source: Failed to create a backup
uz: Zaxira yaratib boʻlmadi

source: Failed to restore from camera
uz: Kameradan tiklab boʻlmadi

source: Failed to restore from a screenshot
uz: Kameradan tiklab boʻlmadi

source: Failed to restore from an image
uz: Rasmdan tiklab boʻlmadi

source: Failed to restore from a file
uz: Fayldan tiklab boʻlmadi

source: Wrong Passphrase
uz: Parol iborasi xato

source: Provider created successfully
uz: Ta’minotchi muvaffaqiyatli yaratildi

source: Provider updated successfully
uz: Ta’minotchi muvaffaqiyatli yangilandi

source: Provider removed successfully
uz: Ta’minotchi muvaffaqiyatli olib tashlandi

source: Editing Provider: {}
uz: Tahrirlash ta’minotchisi: {}

source: The provider has accounts assigned to it, please remove them first
uz: Ta’minotchiga biriktirilgan hisoblarga ega, avval ularni olib tashlang

source: Wrong Password
uz: Parol notoʻgʻri kiritildi
