Repository: itsbilolbek/uzbek-net-dictionary
Catalog: gnome/circle/boatswain.main.*.po
Languages: uz

source: Restore token for the desktop controller
uz: Ish stoli kontrolleri tokenini tiklash

source: Control your Elgato Stream Decks
uz: Elgato striming paketlaringizni boshqaring

source: Boatswain allows you to control Elgato Stream Deck devices.
uz: Boatswain Elgato Stream Deck qurilmalarini boshqarish imkonini beradi.

source: With Boatswain you will be able to:
uz: Boatswain bilan siz quyidagilarni bajara olasiz:

source: Organize your actions in pages and profiles
uz: Sahifalar va profillarda harakatlaringizni tartibga soling

source: Set custom icons to actions
uz: Amallarga maxsus belgilarni sozlash

source: Control your music player
uz: Musiqiy pleyerni boshqarish

source: Play sound effects during your streams
uz: Strim paytida tovush effektlarini ijro qiling

source: Control OBS Studio using Stream Deck (requires the obs-websocket extension)
uz: OBS Studioni Stream Deck yordamida boshqarish (ob-websocket kengaytmasini talab qiladi)

source: Send network requests
uz: Tarmoq soʻrovlarini yuborish

source: Keep track of your gaming score
uz: Oʻyin ballaringizni kuzatib boring

source: Open files and launch applications
uz: Fayllarni ochish va ilovalarni ishga tushirish

source: Default
uz: Standart

source: Unnamed profile
uz: Nomsiz profil

source: Enable debug messages
uz: Debag xabarlarini yoqish

source: Connected to %d device
uz: %d ta qurilmaga ulangan

source: Boatswain needs to run in background to detect and execute Stream Deck actions.
uz: Stream Deck harakatlarini aniqlash va bajarish uchun Boatswain fonda ishlashi kerak.

source: All supported formats
uz: Barcha mos formatlar

source: Select icon
uz: Belgini tanlang

source: Open
uz: Ochiq

source: Button Properties
uz: Tugma xususiyatlari

source: Name
uz: Ism

source: Background Color
uz: Fon rangi

source: Select Action
uz: Amalni tanlang

source: Remove Action
uz: Amalni olib tashlash

source: Actions
uz: Harakatlar

source: Select a button
uz: Bir tugmani tanlang

source: Rename
uz: Qayta nomlash

source: Move up
uz: Yuqoriga surish

source: Move down
uz: Pastga surish

source: Delete
uz: Oʻchirish

source: Glass
uz: Shisha

source: Oh Sheet!
uz: Ey varaq!

source: Pills
uz: Tabletkalar

source: Swoosh
uz: Svuch

source: No Background
uz: Orqa fon mavjud emas

source: Touchscreen Properties
uz: Sensorli ekran xususiyatlari

source: Touchscreen
uz: Sensorli ekran

source: Action
uz: Harakat

source: No Stream Deck Found
uz: Stream Deck topilmadi

source: Plug in a Stream Deck device to use it
uz: Undan foydalanish uchun Stream Deck qurilmasini ulang

source: New profile…
uz: Yangi profil…

source: Brightness
uz: Yorugʻlik

source: Firmware
uz: Mikrodastur

source: _Keyboard Shortcuts
uz: Klaviatura yorliqlari

source: _About Boatswain
uz: Boatswain haqida

source: _Quit
uz: Chiqish

# shortcut window
source: General
uz: Umumiy

# shortcut window
source: Show Shortcuts
uz: Yorliqlarni koʻrsatish

# shortcut window
source: Quit
uz: Chiqish

source: Folder
uz: Jild

source: Switch Profile
uz: Profilni almashtirish

source: Multiple Actions
uz: Bir nechta amal

source: Go Up
uz: Yuqoriga

source: Constant
uz: Doimiy

source: Increase
uz: Koʻpaytirmoq

source: Decrease
uz: Kamaymoq

source: Mode
uz: Rejim

source: Value
uz: Qiymat

source: Delay
uz: Kechikish

source: Add action
uz: Amal kiritish

source: Add Action
uz: Amal kiritish

source: Others
uz: Boshqalar

source: Settings
uz: Sozlamalar

source: Profile
uz: Profil

source: Keyboard Shortcut
uz: Klaviatura yorligʻi

source: Trigger a keyboard shortcut
uz: Tezkor tugmani ishga tushirish

source: Set Shortcut
uz: Yorliqni sozlash

source: Press Esc to cancel
uz: Bekor qilish uchun Esc tugmasini bosing

source: _Cancel
uz: Bekor qilish

source: _Set
uz: Toʻplam

source: Desktop
uz: Ish stoli

source: Score
uz: Hisob

source: Keep track of your score. Reset with a long press.
uz: Ballaringizni kuzatib boring. Uzoq bosib asliga qaytarish.

source: Gaming
uz: Oʻyin oʻynash

source: Restore Score
uz: Hisobni tiklash

source: Text Color
uz: Matn rangi

source: Save to File
uz: Faylga saqlash

source: Save score to a text file. Other apps such as OBS Studio may read from it.
uz: Hisobni matnli faylga saqlang. OBS Studio kabi boshqa ilovalar undan oʻqishi mumkin.

source: File
uz: Fayl

source: Text File (.txt)
uz: Matnli fayl (.txt)

source: Launch Application
uz: Ilovani ishga tushirish

source: Open File
uz: Faylni ochish

source: Open URL
uz: URL manzilni ochish

source: Choose Application
uz: Ilovani tanlash

source: No file selected
uz: Hech qanday fayl belgilanmagan

source: Select File
uz: Faylni tanlash

source: Launcher
uz: Ishga tushirgich

source: HTTP Request
uz: HTTP soʻrovi

source: Send GET and POST requests to a webserver
uz: Veb-serverga GET va POST soʻrovlarini yuborish

source: Select payload file
uz: Faylni tanlang

source: Method
uz: Metod

source: Payload source
uz: Yuklama manbai

source: Edit payload
uz: Yuklamani tahrirlash

source: HTTP Request Payload
uz: HTTP soʻrov yuklamasi

source: Network
uz: Tarmoq

source: Switch Scene
uz: Sahnani almashtirish

source: Record
uz: Yozib olish

source: Virtual Camera
uz: Virtual kamera

source: Toggle Mute
uz: Ovozni yoqish/oʻchirish tugmasi

source: Show / Hide Source
uz: Manbani koʻrsatish / berkitish

source: Invalid password
uz: Parol notoʻgʻri

source: Connection Settings
uz: Ulanish sozlamalari

source: Host
uz: Xost

source: Password
uz: Parol

source: Scene
uz: Manzara

source: Toggle mute
uz: Ovozni yoqish/oʻchirish tugmasi

source: Mute
uz: Ovozsiz

source: Unmute
uz: Ovozni yoqish

source: Toggle visibility
uz: Koʻrinishni almashtirish

source: Hide
uz: Yashirish

source: Show
uz: Koʻrsatish

source: Behavior
uz: Xulq-atvor

source: Audio Source
uz: Audio manbasi

source: Source
uz: Manba

source: Music Player
uz: Musiqiy pleyer

source: Control the active music player
uz: Faol musiqa pleyerini boshqarish

source: Play Audio
uz: Audioni ijro etish

source: Next
uz: Keyingi

source: Pause
uz: Pauza

source: Play
uz: Oʻyin

source: Previous
uz: Avvalgi

source: Stop
uz: Toʻxtatmoq

source: Play / Pause
uz: Ijro / Pauza

source: Playback Action
uz: Ijro amali

source: Audio Files
uz: Audio fayllar

source: Select audio file
uz: Audio faylni tanlash

source: Play / Stop
uz: Ijro / Toʻxtatish

source: Play / Overlap
uz: Ijro / Ustma-ust tushish

source: Play / Restart
uz: Ijro / Qayta ishga tushirish

source: Loop / Stop
uz: Cheksiz / Toʻxtash

source: Press & Hold
uz: Bosish va ushlash

source: Volume
uz: Tovush
