Repository: itsbilolbek/uzbek-net-dictionary
Catalog: gnome/circle/chess-clock.main.*.po
Languages: uz

source: Chess Clock
uz: Shaxmat soati

source: chess;game;clock;timer;
uz: shaxmat;oʻyin;soat;taymer;

source: Time games of over-the-board chess
uz: Doskadan tashqari shaxmat boʻyicha vaqt oʻyinlari

source: Chess Clock is a simple application to provide time control for over-the-board chess games. Intended for mobile use, players select the time control settings desired for their game, then the black player taps their clock to start white's timer. After each player's turn, they tap the clock to start their opponent's, until the game is finished or one of the clocks reaches zero.
uz: Shaxmat soati taxtadan tashqari shaxmat oʻyinlari uchun vaqtni nazorat qilishni ta'minlaydigan oddiy dasturdir. Mobil foydalanish uchun moʻljallangan, oʻyinchilar oʻz oʻyinlari uchun kerakli vaqtni boshqarish sozlamalarini tanlaydilar, soʻngra qora oʻyinchi oq taymerni ishga tushirish uchun oʻz soatiga tegadi. Har bir oʻyinchining navbatidan soʻng, ular oʻyin tugaguniga qadar yoki soatlardan biri nolga yetguncha raqibni boshlash uchun soatni bosadilar.

source: The main screen, showing timers for the white and black players of a chess game
uz: Shaxmat oʻyini oq va qora oʻyinchilar uchun taymerlarni koʻrsatadigan asosiy ekran

source: The time control selection screen
uz: Vaqtni boshqarishni tanlash ekrani

source: The main screen in a portrait aspect ratio, showing one timer rotated 180 degrees
uz: Portret nisbatdagi asosiy ekran, bitta taymer 180 daraja aylantirilganini koʻrsatadi

source: One minute per side, plus zero seconds per turn
uz: Har bir tomonga bir daqiqa, shuningdek, har bir burilish uchun nol soniya

source: Two minutes per side, plus one second per turn
uz: Har bir tomonga ikki daqiqa, shuningdek, har bir burilish uchun bir soniya

source: Five minutes per side, plus zero seconds per turn
uz: Har bir tomon uchun besh daqiqa, shuningdek, har bir burilish uchun nol soniya

source: Five minutes per side, plus three seconds per turn
uz: Har bir tomon uchun besh daqiqa, har bir burilish uchun uch soniya

source: Ten minutes per side, plus zero seconds per turn
uz: Har bir tomonga oʻn daqiqa, shuningdek, har bir burilish uchun nol soniya

source: Ten minutes per side, plus five seconds per turn
uz: Har bir tomonga oʻn daqiqa, shuningdek, har bir burilish uchun besh soniya

source: Thirty minutes per side, plus zero seconds per turn
uz: Har bir tomonga oʻttiz daqiqa, har bir burilish uchun nol soniya

source: Thirty minutes per side, plus twenty seconds per turn
uz: Har bir tomonga oʻttiz daqiqa, har bir burilish uchun yigirma soniya

source: Main time minutes
uz: Asosiy vaqt daqiqalari

source: Main time seconds
uz: Asosiy vaqt soniyalari

source: Increment seconds
uz: Soniyalarni oshiring

# shortcut window
source: Game
uz: Oʻyin

# shortcut window
source: New Time Control
uz: Yangi vaqtni boshqarish

# shortcut window
source: Restart Timer
uz: Taymerni qayta ishga tushiring

# shortcut window
source: General
uz: Umumiy

# shortcut window
source: Open Main Menu
uz: Asosiy menyuni oching

# shortcut window
source: Show Shortcuts
uz: Yorliqlarni koʻrsatish

# shortcut window
source: Close Window
uz: Oynani yopish

# shortcut window
source: Quit
uz: Chiqish

# a11y
source: Select time controls
uz: Vaqtni boshqarish vositalarini tanlang

source: Welcome to Chess Clock
uz: Shaxmat soatiga xush kelibsiz

source: Select time controls below to get started
uz: Boshlash uchun quyida vaqtni boshqarish vositalarini tanlang

source: Time control method
uz: Vaqtni nazorat qilish usuli

source: Increment
uz: Oʻsish

source: Bronstein delay
uz: Bronshteynning kechikishi

source: Simple delay
uz: Oddiy kechikish

source: Start Game
uz: Oʻyinni boshlash

source: Main Menu
uz: Asosiy menyu

source: Toggle Pause
uz: Toʻxtatib turish

# a11y
source: Player white timer
uz: Oʻyinchi oq taymer

# a11y
source: Player black timer
uz: Oʻyinchi uchun qora taymer

source: _New Time Control
uz: _Yangi vaqtni boshqarish

source: _Restart Timer
uz: _Taymerni qayta ishga tushirish

source: _Mute Alert Sound
uz: _Ogohlantirish ovozini oʻchirish

source: _Keyboard Shortcuts
uz: _Klaviatura yorliqlari

source: _About Chess Clock
uz: _Shaxmat soati haqida

source: translator-credits
uz: Baxrom Raxmatov <magdiyevbahrom@gmail.com>

source: Player white timer
uz: Oʻyinchi oq taymer

source: Player black timer
uz: Oʻyinchi uchun qora taymer
