Repository: itsbilolbek/uzbek-net-dictionary
Catalog: gnome/circle/drum-machine.master.*.po
Languages: uz

source: Drum Machine
uz: Baraban mashinasi

source: drum;drums;sequencer;rhythm;music;pattern;beats;percussion;loop;groove;
uz: baraban;barabanlar;sequencer;ritm;musiqa;naqsh;zarblar;zarb;halqa;oʻyiq;

source: Create and play drum beats
uz: Baraban zarblarini yaratish va ijro etish

source: Drum Machine is a modern and intuitive application for creating, playing, and managing drum patterns. Perfect for musicians, producers, and anyone interested in rhythm creation, this application provides a simple interface for drum pattern programming. Have fun!
uz: Baraban mashinasi - ritm naqshlarini yaratish, chalish va boshqarish uchun moʻljallangan zamonaviy va qulay dastur. Musiqachilar, prodyuserlar va ritm yaratishga qiziquvchilar uchun aynan moslashtirilgan bu dastur baraban naqshlarini dasturlash uchun sodda interfeysni taqdim etadi. Maroqli vaqt oʻtkazing!

source: Features:
uz: Xususiyatlar:

source: Intuitive grid-based pattern editor
uz: Gridga asoslangan intuitiv naqsh muharriri

source: Adjustable BPM control
uz: Sozlanadigan DZ boshqaruvi

source: Volume control for overall mix
uz: Umumiy miks uchun tovush balandligini boshqarish

source: Save and load preset patterns
uz: Oldindan sozlangan andozalarni saqlash va yuklash

source: Multiple drum sounds including kick, snare, hi-hat, and more
uz: Bir nechta baraban tovushlari, jumladan, kik, snare, hi-hat va boshqalar

source: Audio export feature with support for WAV, FLAC, Ogg, and MP3 formats
uz: WAV, FLAC, Ogg va MP3 formatlarini qoʻllab-quvvatlaydigan audio eksporti funksiyasi

source: Metadata support for embedding artist name, song title, and cover art
uz: Ijrochi nomi, qoʻshiq sarlavhasi va muqova rasmini joylashtirish uchun meta-ma’lumotlarni qoʻllab-quvvatlash

source: Keyboard shortcuts for quick access to all functions
uz: Barcha funksiyalarga tezkor kirish uchun klaviatura yorliqlari

source: Drum Pattern Loaded in Light Mode
uz: Yorugʻlik rejimida baraban naqshi yuklandi

source: Drum Pattern Loaded in Dark Mode
uz: Qorongʻi rejimda baraban naqshi yuklandi

source: translator-credits
uz: Hamidulloh Toʻxtayev <toxtayevhamidulloh6997@gmail.com>

source: MP3 files
uz: MP3 fayllar

source: FLAC files
uz: FLAC fayllar

source: FLAC (Lossless)
uz: FLAC (Yoʻqotishsiz)

source: Ogg files
uz: Ogg fayllar

source: WAV files
uz: WAV fayllar

source: WAV (Uncompressed)
uz: WAV (zichlanmagan audio fayl formati)

source: Save Audio File
uz: Audio faylni saqlash

source: Image files
uz: Rasm fayllar

source: Select Cover Art
uz: Muqova san’atini tanlang

source: Audio exported to {}
uz: Audio {} jildiga eksport qilindi

source: Export failed
uz: Eksport amalga oshmadi

source: Export cancelled successfully
uz: Eksport muvaffaqiyatli bekor qilindi

source: Default Presets
uz: Birlamchi sozlamalar

source: No Pattern
uz: Naqshsiz

source: Please create a drum pattern before exporting audio.
uz: Audioni eksport qilishdan oldin baraban naqshini yarating.

source: _OK
uz: Hop

source: MIDI files
uz: MIDI fayllar

source: Open MIDI File
uz: MIDI faylni ochish

source: Save Sequence
uz: Ketma-ketlikni saqlash

source: Preparing...
uz: Tayyorlanmoqda…

source: Initializing...
uz: Ishga tushirilmoqda...

source: Rendering audio...
uz: Audio tayyorlanmoqda...

source: Processing beats...
uz: Ritmlar ishlanmoqda...

source: Saving file...
uz: Fayl saqlanmoqda...

source: Writing to disk...
uz: Diskka yozilmoqda...

source: Exporting...
uz: Eksport qilinmoqda…

source: Processing...
uz: Qayta ishlanmoqda...

source: {} Beats per Minute (BPM)
uz: Daqiqasiga {} ta zarba (DZ)

source: {:.0f}% Volume
uz: {:.0f}% ovoz balandligi

source: Play
uz: Ijro

source: Pause
uz: Toʻxtatish

source: Open
uz: Ochish

source: Open Preset
uz: Tayyor sozlamani ochish

# accessibility
source: Open Preset
uz: Tayyor sozlamani ochish

source: Open Saved Drum Pattern Preset
uz: Saqlangan baraban naqsh sozlamasini ochish

source: Main Menu
uz: Asosiy menyu

# accessibility
source: Main Menu
uz: Asosiy menyu

source: Access Keyboard Shortcuts and Application Information
uz: Klaviatura yorliqlari va ilova haqidagi axborotga kirish

source: Export Audio
uz: Audioni eksport qilish

# accessibility
source: Export Audio
uz: Audioni eksport qilish

source: Export Current Drum Pattern as Audio File
uz: Joriy baraban naqshini audio fayl sifatida eksport qilish

source: BPM
uz: DZ

source: Adjust Tempo In Beats per Minute (BPM)
uz: Bir daqiqadagi zarbalar tezligini sozlash (DZ)

source: Tempo
uz: Tezlik

source: Adjust Volume
uz: Ovoz balandligini sozlash

source: Reset
uz: Qayta tiklash

source: Reset the Drum Sequence
uz: Baraban ketma-ketligini asliga qaytarish

source: _Keyboard Shortcuts
uz: Klaviatura yorliqlari

source: _About Drum Machine
uz: Barabanli mashina haqida

# shortcut window
source: General
uz: Umumiy

# shortcut window
source: Show Shortcuts
uz: Yorliqlarni koʻrsatish

# shortcut window
source: Quit
uz: Chiqish

# shortcut window
source: Playback Controls
uz: Ijro boshqaruvi

# shortcut window
source: Play/Pause
uz: Tinglash/Toʻxtatish

# shortcut window
source: Clear All
uz: Hammasini tozalash

# shortcut window
source: BPM & Volume Controls
uz: DZ va tovush balandligini boshqarish

# shortcut window
source: Increase BPM
uz: DZ darajasini oshirish

# shortcut window
source: Decrease BPM
uz: DZ darajasini kamaytirish

# shortcut window
source: Increase Volume
uz: Ovoz balandligini oshirish

# shortcut window
source: Decrease Volume
uz: Ovoz balandligini pasaytirish

# shortcut window
source: Mute
uz: Ovozsiz

# shortcut window
source: Preset Management
uz: Oldindan sozlash boshqaruvi

# shortcut window
source: Load Preset
uz: Tayyor sozlamani yuklash

# shortcut window
source: Save Preset
uz: Tayyor sozlamani saqlash

# shortcut window
source: Export Audio
uz: Audioni eksport qilish

# shortcut window
source: Navigation
uz: Navigatsiya

# shortcut window
source: Go to Instrument
uz: Uskunani ochish

# shortcut window
source: Previous Page
uz: Oldingi sahifa

# shortcut window
source: Next Page
uz: Keyingi sahifa

source: Save Changes?
uz: Oʻzgarishlar saqlansinmi?

source: Current preset contains unsaved changes. Changes which are not saved will be permanently lost.
uz: Joriy sozlamada saqlanmagan oʻzgarishlar mavjud. Saqlanmagan oʻzgarishlar butunlay yoʻqoladi.

source: _Cancel
uz: Bekor qilish

source: _Discard
uz: Bekor qilish

source: _Save
uz: Saqlash

source: Audio Format
uz: Audio formati

source: Repeat Count
uz: Takrorlashlar soni

source: How many times to repeat the pattern
uz: Naqshni necha marta takrorlash kerak

source: Metadata
uz: Meta maʼlumotlar

source: Artist Name
uz: Ijrochi nomi

source: Song Name
uz: Tarona nomi

source: Cover Art
uz: Muqova san’ati

source: Choose File
uz: Faylni tanlash

source: Cancel Export
uz: Eksportni bekor qilish
