Repository: itsbilolbek/uzbek-net-dictionary
Catalog: gnome/circle/identity.master.*.po
Languages: uz

source: Identity
uz: Identifikatsiya

source: Compare images and videos
uz: Rasm va videolarni solishtirish

source: Movie;Film;Clip;Video;Image;Difference;Frame;Quality;Compare;Check;
uz: Kino;Film;Klip;Video;Rasm;Farq;Kadr;Sifat;Taqqoslash;Tekshirish;

source: A program for comparing multiple versions of an image or video.
uz: Rasm yoki videoning bir nechta versiyalarini taqqoslash dasturi.

source: You can arrange videos in a row
uz: Videolarni ketma-ket joylashingiz mumkin

source: You can arrange images in a column
uz: Rasmlarni ustunga joylashtirishingiz mumkin

source: You can open files as tabs
uz: Fayllarni tab sifatida ochish mumkin

source: Inspect a few properties of a video in a dialog
uz: Dialogda videoning bir nechta xususiyatlarini tekshiring

source: Properties
uz: Xususiyatlar

source: No Media Open
uz: Media ochiq emas

source: Open a video or image to view its properties.
uz: Xususiyatlarini koʻrish uchun video yoki rasmni oching.

source: File
uz: Fayl

source: Name
uz: Ism

source: Location
uz: Joylashuv

source: Resolution
uz: Piksel aniqligi

source: Frame Rate
uz: Kadr tezligi

source: Codec
uz: Kodek

source: Container
uz: Konteyner

source: File Failed to Load
uz: Fayl yuklanishda xatolik yuz berdi

source: Could not display the file. If you're running Identity under Flatpak, note that opening files by drag-and-drop and by pasting may not work.
uz: Fayl koʻrsatilmadi. Agar Flatpak orqali Identity dasturini ishga tushirayotgan boʻlsangiz, fayllarni sichqoncha yordamida sudrab tashlash va joylash orqali ochish ishlamasligi mumkin.

# shortcut window
source: Switch between files
uz: Fayllar orasida almashish

# shortcut window
source: Open videos or images
uz: Video yoki rasmlarni ochish

# shortcut window
source: Open file from clipboard
uz: Buferdan faylni ochish

# shortcut window
source: New window
uz: Yangi oyna

# shortcut window
source: Copy selected file to clipboard
uz: Tanlangan faylni buferga nusxalash

# shortcut window
source: Close selected file
uz: Tanlangan faylni yopish

# shortcut window
source: Show media properties
uz: Media xususiyatlarini koʻrsatish

# shortcut window
source: Show shortcuts
uz: Yorliqlarni koʻrsatish

# shortcut window
source: Quit
uz: Chiqish

# shortcut window
source: Playback
uz: Qayta ijro

# shortcut window
source: Play / Pause
uz: Ijro / Pauza

# shortcut window
source: Step forward one frame
uz: Bitta kadrni oldinga surish

# shortcut window
source: Step back one frame
uz: Bitta kadr orqaga surish

# shortcut window
source: Zoom in
uz: Kattalashtirish

# shortcut window
source: Zoom out
uz: Kichiklashtirish

# shortcut window
source: Zoom 1:1
uz: 1:1 masshtab

# shortcut window
source: Best fit
uz: Eng yaxshi moslik

# shortcut window
source: Display
uz: Koʻrsatish

# shortcut window
source: Arrange as tabs
uz: Tab sifatida tartiblash

# shortcut window
source: Arrange in a row
uz: Qatorga sifatida tartiblash

# shortcut window
source: Arrange in a column
uz: Ustun sifatida tartiblash

source: _New Window
uz: Yangi oyna

source: _Media Properties
uz: Multimedia xususiyatlari

source: _Keyboard Shortcuts
uz: Klaviatura yorliqlari

source: _About Identity
uz: Shaxs haqida

source: Copy File
uz: Faylni nusxalash

source: Show in Files
uz: Fayllarda koʻrsatish

source: Move to New Window
uz: Yangi oynaga oʻtish

source: Close File
uz: Faylni yopish

source: Arrange as Tabs
uz: Varaqlar sifatida tartiblash

source: Arrange in a Row
uz: Qator qilib joylashtirmoq

source: Arrange in a Column
uz: Ustun qilib joylashtirmoq

source: Main Menu
uz: Asosiy menyu

source: Compare Media
uz: Medialarni taqqoslash

source: Drag and drop images or videos here
uz: Rasmlar yoki videolarni bu yerga sudrab tashlang

source: Open Media…
uz: Media fayllarni ochish…

source: Select an Image or Video
uz: Rasm yoki videoni tanlang

source: Open
uz: Ochish

source: Zoom Level
uz: Kattalashtirish darajasi

source: Select Zoom Level
uz: Kattalashtirish darajasini tanlang

source: Play / Pause
uz: Tinglash/Toʻxtatish

source: Playback position
uz: Ijro holati

source: translator-credits
uz: Hamidulloh Toʻxtayev <toxtayevhamidulloh6997@gmail.com>

source: Contribute Translations
uz: Tarjimalarga hissa qoʻshish

source: Video Trimmer
uz: Videoni qirqish vositasi

source: Trim videos quickly
uz: Videolarni tezda kesish

source: This release adds a context menu to row and column display modes and updates the platform to GNOME 49.
uz: Ushbu yangilanishda qator va ustun koʻrsatish rejimlariga kontekst menyu qoʻshildi hamda platforma GNOME 49 versiyasiga yangilandi.

source: Updated to the GNOME 49 platform.
uz: GNOME 49 platformasiga yangilandi.

source: Updated translations.
uz: Yangilangan tarjimalar.

source: Best Fit
uz: Eng yaxshi moslik

source: Videos and images
uz: Video va rasmlar

source: Open videos or images to compare
uz: Taqqoslash uchun video yoki rasmlarni oching
