Repository: itsbilolbek/uzbek-net-dictionary
Catalog: gnome/infra/apps-for-gnome.main.*.po
Languages: uz

source: About Us
uz: Biz haqimizda

source: App is translated
uz: Ilova tarjima qilingan

source: App specific content © The respective app contributors
uz: Ilovaga xos kontent © Tegishli ilova ishtirokchilari

source: App supports mobile devices
uz: Ilova mobil qurilmalarni qo'llab-quvvatlaydi

source: Apps featured in this curated overview are all built with the GNOME philosophy in mind. They are easy to understand and simple to use, feature a consistent and polished design and provide a noticeable attention to details. Naturally, they are [free software](https://fsfe.org/freesoftware/) and have committed to being part of a [welcoming and friendly community](https://conduct.gnome.org/). These apps will perfectly integrate with your [GNOME Desktop](https://www.gnome.org/).
uz: Ushbu saralangan umumiy ko'rinishda taqdim etilgan ilovalarning barchasi GNOME falsafasini hisobga olgan holda yaratilgan. Ular tushunarli va ishlatish uchun sodda, izchil va sayqallangan dizaynga ega va tafsilotlarga sezilarli e'tibor beradi. Tabiiyki, ular [bepul dasturiy ta'minot](https://fsfe.org/freesoftware/) va [mehribon va do'stona hamjamiyat] (https://conduct.gnome.org/) a'zosi bo'lishni o'z zimmalariga olishgan. Bu ilovalar [GNOME Desktop](https://www.gnome.org/) bilan mukammal birlashadi.

source: Apps for GNOME
uz: GNOME uchun ilovalar

source: Apps supported on GNOME mobile devices are marked with the mobile icon.
uz: GNOME mobil qurilmalarida qo'llab-quvvatlanadigan ilovalar mobil belgisi bilan belgilanadi.

source: Circle
uz: Aylana

source: Circle Apps
uz: Circle ilovalari

source: Close Language Selection
uz: Til tanlashni yoping

source: Contact Us
uz: Biz bilan bog'lanish

source: Contribute
uz: Hissa qo‘shish

source: Contribute your ideas or report issues on the app’s issue tracker.
uz: Ilovaning muammo kuzatuvchisi bo'yicha g'oyalaringizni qo'shing yoki muammolar haqida xabar bering.

source: Core
uz: Yadro

source: Core Apps
uz: Asosiy ilovalar

source: Development
uz: Rivojlanish

source: Development Tools
uz: Rivojlanish vositalari

source: Discover the best Apps for GNOME
uz: GNOME uchun eng yaxshi ilovalarni kashf eting

source: Discover the best applications in the GNOME ecosystem and learn how to get involved.
uz: GNOME ekotizimidagi eng yaxshi ilovalarni kashf eting va qanday ishtirok etishni o'rganing.

source: Donate money
uz: Pul xayriya qiling

source: Donate to the GNOME Foundation to support this project.
uz: Ushbu loyihani qo'llab-quvvatlash uchun GNOME fondiga xayriya qiling.

source: Explore the interface
uz: Interfeysni o'rganing

source: GNOME Circle contains applications extending the GNOME ecosystem. It champions the great additional software that is available for the GNOME platform. [Learn more about GNOME Circle.](https://circle.gnome.org/)
uz: GNOME Circle GNOME ekotizimini kengaytiruvchi ilovalarni o'z ichiga oladi. U GNOME platformasi uchun mavjud bo'lgan ajoyib qo'shimcha dasturiy ta'minotni qo'llab-quvvatlaydi. [GNOME Circle haqida koʻproq maʼlumot oling.](https://circle.gnome.org/)

source: GNOME Core apps cover ordinary tasks on the GNOME desktop. They are usually pre-installed on your GNOME system.
uz: GNOME Core ilovalari GNOME ish stolidagi oddiy vazifalarni qamrab oladi. Ular odatda GNOME tizimingizda oldindan o'rnatiladi.

source: GNOME Development tools help develop and design new apps and make it easy to contribute to existing ones.
uz: GNOME dasturlash vositalari yangi ilovalarni ishlab chiqish va loyihalashda yordam beradi hamda mavjudlariga hissa qo‘shishni osonlashtiradi.

source: Get in touch
uz: Aloqa qiling

source: Get involved
uz: Ishtirok eting

source: Get the app
uz: Ilovani yuklab oling

source: Get to know us
uz: Biz bilan tanishing

source: GitHub account
uz: GitHub hisobi

source: GitLab account
uz: GitLab hisobi

source: Give feedback
uz: Fikr bildiring

source: Help translate this app into your language.
uz: Ushbu ilovani tilingizga tarjima qilishga yordam bering.

source: Help translating
uz: Tarjima qilishga yordam bering

source: Install the latest version from Flathub.
uz: Flathub-dan so'nggi versiyani o'rnating.

source: Just chat with the app's community or get help when you are stuck.
uz: Shunchaki ilova hamjamiyati bilan suhbatlashing yoki qotib qolganingizda yordam oling.

source: Keywords
uz: Kalit so'zlar

source: Latest version { version_name } released on { date }.
uz: Oxirgi versiya { version_name } { sana} da chiqarilgan.

source: Learn how you can contact the project.
uz: Loyiha bilan qanday bog'lanishingiz mumkinligini bilib oling.

source: Learn how you can contribute to this app.
uz: Ushbu ilovaga qanday hissa qoʻshishingiz mumkinligini bilib oling.

source: Learn how you can donate to the developers of this project.
uz: Ushbu loyihani ishlab chiquvchilarga qanday xayriya qilishingiz mumkinligini bilib oling.

source: Learn more
uz: Ko'proq ma'lumot olish

source: Maintainer
uz: Ta'minotchi

source: More Information
uz: Batafsil

source: Newest Release
uz: Eng yangi nashr

source: Not translated
uz: Tarjima qilinmagan

source: Only a small part of this app is available in your language.
uz: Bu ilovaning faqat kichik bir qismi sizning tilingizda mavjud.

source: Overview
uz: Umumiy nuqtai

source: Page Software
uz: Sahifa dasturiy ta'minot

source: Page generated
uz: Sahifa yaratildi

source: Partially translated
uz: Qisman tarjima qilingan

source: Privacy
uz: Maxfiylik

source: Project homepage
uz: Loyiha bosh sahifasi

source: Releases
uz: Relizlar

source: Select Language
uz: Tilni tanlang

source: Some parts of this app are available in your language.
uz: Ushbu ilovaning ayrim qismlari sizning tilingizda mavjud.

source: Sparsely translated
uz: Kamdan-kam tarjima qilingan

source: Switch Language
uz: Tilni almashtirish

source: The GNOME Project
uz: GNOME loyihasi

source: This app is available in your language.
uz: Bu ilova sizning tilingizda mavjud.

source: This app is not available in your language.
uz: Bu ilova sizning tilingizda mavjud emas.

source: This website is available in many languages
uz: Ushbu veb-sayt ko'plab tillarda mavjud

source: Visit the dedicated homepage for this project.
uz: Ushbu loyiha uchun maxsus bosh sahifaga tashrif buyuring.

source: Visit the online help page for this app.
uz: Ushbu ilova uchun onlayn yordam sahifasiga tashrif buyuring.

source: Website
uz: Websayt

source: [Disability Pride Month](https://en.wikipedia.org/wiki/Disability_Pride_Month), displaying two [disability flags](https://en.wikipedia.org/wiki/Disability_flag) and an [autistic flag](https://en.wikipedia.org/wiki/Autistic_Pride_Day).
uz: [Nogironlik bilan faxrlanish oyi](https://en.wikipedia.org/wiki/Disability_Pride_Month), ikkita [nogironlik bayrog'i](https://en.wikipedia.org/wiki/Disability_flag) va [otistik bayroq](https://en.wikipedia.org/wiki/ay) ko'rsatilgan.

source: [Queer Pride Month](https://en.wikipedia.org/wiki/Pride_Month), displaying the [intersex](https://en.wikipedia.org/wiki/Intersex_flag), [trans](https://en.wikipedia.org/wiki/Transgender_flag), and [rainbow](https://en.wikipedia.org/wiki/Rainbow_flag_(LGBT)), flags.
uz: [Queer Pride Month](https://en.wikipedia.org/wiki/Pride_Month), [intersex](https://en.wikipedia.org/wiki/Intersex_flag), [trans](https://en.wikipedia.org/wiki/Transgender_flag) va [kamalak](https://en.wikipedia.org/wiki/Rainbow_flag_(LGBT)), bayroqlar.

source: {} account
uz: Yangi hisob qo'shing

source: © The “Apps for GNOME” contributors
uz: © “GNOME uchun ilovalar” ishtirokchilari
