Repository: itsbilolbek/uzbek-net-dictionary
Catalog: po/gnome-menus.master.*.po
Languages: uz

source: Sound & Video
uz: Ovoz va video

source: Multimedia menu
uz: Multimedia menyusi

source: Programming
uz: Dasturlash

source: Tools for software development
uz: Dasturiy taʼminotni ishlab chiqish uchun vositalar

source: Education
uz: Taʼlim

source: Games
uz: Oʼyinlar

source: Games and amusements
uz: Oʼyinlar va oʼyin-kulgilar

source: Graphics
uz: Grafika

source: Graphics applications
uz: Grafik ilovalar

source: Programs for Internet access such as web and email
uz: Internet va elektron pochta kabi Internetga kirish uchun dasturlar

source: Office
uz: Ofis

source: Office Applications
uz: Ofis ilovalari

source: System Tools
uz: Tizim asboblari

source: System configuration and monitoring
uz: Tizim konfiguratsiyasi va monitoringi

source: Universal Access
uz: Universal kirish

source: Universal Access Settings
uz: Tizim konfiguratsiyasi va monitoringi

source: Accessories
uz: Aksessuarlar

source: Desktop accessories
uz: Ish stoli aksessuarlari

source: Applications
uz: Ilovalar

source: Other
uz: Boshqa

source: Applications that did not fit in other categories
uz: Boshqa toifalarga mos kelmaydigan ilovalar

source: Sundry
uz: Har xil

source: Utilities
uz: Utilitalar

source: Small but useful GNOME tools
uz: Kichik, ammo foydali GNOME vositalari

source: Web Applications
uz: Veb-ilovalar

source: Applications and sites saved from Web
uz: Internetdan saqlangan ilovalar va saytlar
